In [2]:
import pandas as pd

In [3]:
dict={
    "name":["harry","rohan","skillf","subh"],"marks":[50,89,45,75],"city":["rampur","kolkata","delhi","northpole"]
}

In [5]:
df=pd.DataFrame(dict)

In [6]:
df

     name  marks       city
0   harry     50     rampur
1   rohan     89    kolkata
2  skillf     45      delhi
3    subh     75  northpole

In [7]:
df.to_csv("friends.csv")

In [8]:
df.to_csv("friends_no_index.csv",index=False)

In [9]:
df.head(2)

    name  marks     city
0  harry     50   rampur
1  rohan     89  kolkata

In [10]:
df.tail(2)

     name  marks       city
2  skillf     45      delhi
3    subh     75  northpole

In [12]:
df.describe()

           marks
count   4.000000
mean   64.750000
std    20.822664
min    45.000000
25%    48.750000
50%    62.500000
75%    78.500000
max    89.000000

In [25]:
#Read csv

csvread=pd.read_csv("train.csv")

In [28]:
csvread

   TrainNo  speed          city
0    57655     90         patna
1    79878     70         delhi
2    74988     54        raipur
3    12312     87       jodhpur
4    52454     40        punjab
5    25143     65  bangaladfesh

In [27]:
csvread["speed"][0]=90

<ipython-input-27-f12af54989f5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  csvread["speed"][0]=90

In [29]:
csvread.to_csv('train.csv')

In [33]:
csvread.index=['first','second','third','fourth','fifth','sixth']

In [34]:
csvread

        TrainNo  speed          city
first     57655     90         patna
second    79878     70         delhi
third     74988     54        raipur
fourth    12312     87       jodhpur
fifth     52454     40        punjab
sixth     25143     65  bangaladfesh